package org.delicious.Applications;

import java.util.Scanner;

import org.delicious.Beautification.AnimatedPrompts;
import org.delicious.Beautification.ProgressBar;

import static org.delicious.Beautification.AnsiColorCodes.*;
//AnimatedPrompts.animatePrompt("Welcome to DELI-cious! What would you like to order?");

public class HomeScreen {
    public void display() {

        System.out.println(yellow + bold + """
                ░██╗░░░░░░░██╗███████╗██╗░░░░░░█████╗░░█████╗░███╗░░░███╗███████╗░░░░░░░░████████╗░█████╗░
                ░██║░░██╗░░██║██╔════╝██║░░░░░██╔══██╗██╔══██╗████╗░████║██╔════╝░░░░░░░░╚══██╔══╝██╔══██╗
                ░╚██╗████╗██╔╝█████╗░░██║░░░░░██║░░╚═╝██║░░██║██╔████╔██║█████╗░░░░░░░░░░░░░██║░░░██║░░██║
                ░░████╔═████║░██╔══╝░░██║░░░░░██║░░██╗██║░░██║██║╚██╔╝██║██╔══╝░░░░░░░░░░░░░██║░░░██║░░██║
                ░░╚██╔╝░╚██╔╝░███████╗███████╗╚█████╔╝╚█████╔╝██║░╚═╝░██║███████╗░░░░░░░░░░░██║░░░╚█████╔╝
                ░░░╚═╝░░░╚═╝░░╚══════╝╚══════╝░╚════╝░░╚════╝░╚═╝░░░░░╚═╝╚══════╝░░░░░░░░░░░╚═╝░░░░╚════╝░
                                
                ██████╗░███████╗██╗░░░░░██╗░░░░░░░█████╗░██╗░█████╗░██╗░░░██╗░██████╗██╗
                ██╔══██╗██╔════╝██║░░░░░██║░░░░░░██╔══██╗██║██╔══██╗██║░░░██║██╔════╝██║
                ██║░░██║█████╗░░██║░░░░░██║█████╗██║░░╚═╝██║██║░░██║██║░░░██║╚█████╗░██║
                ██║░░██║██╔══╝░░██║░░░░░██║╚════╝██║░░██╗██║██║░░██║██║░░░██║░╚═══██╗╚═╝
                ██████╔╝███████╗███████╗██║░░░░░░╚█████╔╝██║╚█████╔╝╚██████╔╝██████╔╝██╗
                ╚═════╝░╚══════╝╚══════╝╚═╝░░░░░░░╚════╝░╚═╝░╚════╝░░╚═════╝░╚═════╝░╚═╝\s
                
                
                \033[1m𝖂𝖍𝖊𝖗𝖊 𝖞𝖔𝖚 𝖈𝖆𝖓 𝖌𝖊𝖙 𝖞𝖔𝖚𝖗 𝕯𝖊𝖑𝖎 𝕮𝖗𝖆𝖛𝖎𝖓𝖌𝖘 𝖘𝖆𝖙𝖎𝖘𝖋𝖎𝖊𝖉!\033[1m
                """);
        AnimatedPrompts.animatePrompt(bold + """
                𝗣𝗹𝗲𝗮𝘀𝗲 𝘀𝗲𝗹𝗲𝗰𝘁 𝗮𝗻 𝗼𝗽𝘁𝗶𝗼𝗻 𝘁𝗼 𝗮𝗰𝗾𝘂𝗶𝗿𝗲 𝗮 𝗗𝗲𝗹𝗶𝗰𝗶𝗼𝘂𝘀 𝗦𝗮𝗻𝗱𝘄𝗶𝗰𝗵:
                \s
                1. 𝙉𝙚𝙬 𝙊𝙧𝙙𝙚𝙧
                0. 𝙀𝙭𝙞𝙩
                """);

        Scanner scanner = new Scanner(System.in);
        int userChoice = scanner.nextInt();

        switch (userChoice) {
            case 1 -> {
                progressBar();
                new OrderScreen().display();
            }
            case 0 -> {
                System.out.println(red + """                 
                        ███╗░░██╗░█████╗░░██╗░░░░░░░██╗░░░░░███████╗██╗░░██╗██╗████████╗██╗███╗░░██╗░██████╗░░░░░░░░░░
                        ████╗░██║██╔══██╗░██║░░██╗░░██║░░░░░██╔════╝╚██╗██╔╝██║╚══██╔══╝██║████╗░██║██╔════╝░░░░░░░░░░
                        ██╔██╗██║██║░░██║░╚██╗████╗██╔╝░░░░░█████╗░░░╚███╔╝░██║░░░██║░░░██║██╔██╗██║██║░░██╗░░░░░░░░░░
                        ██║╚████║██║░░██║░░████╔═████║░░░░░░██╔══╝░░░██╔██╗░██║░░░██║░░░██║██║╚████║██║░░╚██╗░░░░░░░░░
                        ██║░╚███║╚█████╔╝░░╚██╔╝░╚██╔╝░░░░░░███████╗██╔╝╚██╗██║░░░██║░░░██║██║░╚███║╚██████╔╝██╗██╗██╗
                        ╚═╝░░╚══╝░╚════╝░░░░╚═╝░░░╚═╝░░░░░░░╚══════╝╚═╝░░╚═╝╚═╝░░░╚═╝░░░╚═╝╚═╝░░╚══╝░╚═════╝░╚═╝╚═╝╚═╝
                        """ + reset);

                System.exit(0);
            }
            default -> {
                System.out.println("Invalid Choice");
            }
        }
    }

    public static void progressBar() {
        // Progress Bar Animation
        try {
            String[] String = new String[0];
            ProgressBar.main(String);
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
    }
}