package org.delicious.controller;

import java.util.Scanner;

import org.delicious.view.AnimatedPrompts;
import org.delicious.view.ProgressBar;

import static org.delicious.view.AnsiColorCodes.*;

public class HomeScreen {
    public static void display(Scanner scanner) {

        System.out.println(yellow + bold + """
                                
                ░██╗░░░░░░░██╗███████╗██╗░░░░░░█████╗░░█████╗░███╗░░░███╗███████╗░░░░░░░░████████╗░█████╗░
                ░██║░░██╗░░██║██╔════╝██║░░░░░██╔══██╗██╔══██╗████╗░████║██╔════╝░░░░░░░░╚══██╔══╝██╔══██╗
                ░╚██╗████╗██╔╝█████╗░░██║░░░░░██║░░╚═╝██║░░██║██╔████╔██║█████╗░░░░░░░░░░░░░██║░░░██║░░██║
                ░░████╔═████║░██╔══╝░░██║░░░░░██║░░██╗██║░░██║██║╚██╔╝██║██╔══╝░░░░░░░░░░░░░██║░░░██║░░██║
                ░░╚██╔╝░╚██╔╝░███████╗███████╗╚█████╔╝╚█████╔╝██║░╚═╝░██║███████╗░░░░░░░░░░░██║░░░╚█████╔╝
                ░░░╚═╝░░░╚═╝░░╚══════╝╚══════╝░╚════╝░░╚════╝░╚═╝░░░░░╚═╝╚══════╝░░░░░░░░░░░╚═╝░░░░╚════╝░
                                
                ██████╗░░█████╗░██████╗░░█████╗░██╗░██████╗░░░░░░░░░██████╗██╗░░░██╗██████╗░███████╗██████╗░██╗░█████╗░██╗
                ██╔══██╗██╔══██╗██╔══██╗██╔══██╗╚█║██╔════╝░░░░░░░░██╔════╝██║░░░██║██╔══██╗██╔════╝██╔══██╗██║██╔══██╗██║
                ██████╔╝███████║██████╔╝███████║░╚╝╚█████╗░░░░░░░░░╚█████╗░██║░░░██║██████╦╝█████╗░░██████╔╝██║███████║██║
                ██╔═══╝░██╔══██║██╔═══╝░██╔══██║░░░░╚═══██╗░░░░░░░░░╚═══██╗██║░░░██║██╔══██╗██╔══╝░░██╔══██╗██║██╔══██║╚═╝
                ██║░░░░░██║░░██║██║░░░░░██║░░██║░░░██████╔╝░░░░░░░░██████╔╝╚██████╔╝██████╦╝███████╗██║░░██║██║██║░░██║██╗
                ╚═╝░░░░░╚═╝░░╚═╝╚═╝░░░░░╚═╝░░╚═╝░░░╚═════╝░░░░░░░░░╚═════╝░░╚═════╝░╚═════╝░╚══════╝╚═╝░░╚═╝╚═╝╚═╝░░╚═╝╚═╝\s
                                
                                
                \033[1m𝖂𝖍𝖊𝖗𝖊 𝖞𝖔𝖚 𝖈𝖆𝖓 𝖌𝖊𝖙 𝖙𝖍𝖊𝖒 𝖋𝖆𝖒𝖔𝖚𝖘 𝕻𝖆𝖕𝖆❜𝖘 𝕾𝖚𝖇𝖘!\033[1m
                """);

        while (true) {
            System.out.println(yellow + bold + """
                                    
                    𝗣𝗹𝗲𝗮𝘀𝗲 𝘀𝗲𝗹𝗲𝗰𝘁 𝗮𝗻 𝗼𝗽𝘁𝗶𝗼𝗻 𝘁𝗼 𝗮𝗰𝗾𝘂𝗶𝗿𝗲 𝗮 𝗗𝗲𝗹𝗶𝗰𝗶𝗼𝘂𝘀 𝗦𝗮𝗻𝗱𝘄𝗶𝗰𝗵:
                    \s
                    1. 𝙉𝙚𝙬 𝙊𝙧𝙙𝙚𝙧
                    0. 𝙀𝙭𝙞𝙩
                    """);

            switch (userInputs(scanner)) {
                case 1 -> {
//                    progressBar();
                    OrderScreen.display(scanner);
                }
                case 0 -> {
                    System.out.println(red + """                 
                            ███╗░░██╗░█████╗░░██╗░░░░░░░██╗░░░░░███████╗██╗░░██╗██╗████████╗██╗███╗░░██╗░██████╗░░░░░░░░░░
                            ████╗░██║██╔══██╗░██║░░██╗░░██║░░░░░██╔════╝╚██╗██╔╝██║╚══██╔══╝██║████╗░██║██╔════╝░░░░░░░░░░
                            ██╔██╗██║██║░░██║░╚██╗████╗██╔╝░░░░░█████╗░░░╚███╔╝░██║░░░██║░░░██║██╔██╗██║██║░░██╗░░░░░░░░░░
                            ██║╚████║██║░░██║░░████╔═████║░░░░░░██╔══╝░░░██╔██╗░██║░░░██║░░░██║██║╚████║██║░░╚██╗░░░░░░░░░
                            ██║░╚███║╚█████╔╝░░╚██╔╝░╚██╔╝░░░░░░███████╗██╔╝╚██╗██║░░░██║░░░██║██║░╚███║╚██████╔╝██╗██╗██╗
                            ╚═╝░░╚══╝░╚════╝░░░░╚═╝░░░╚═╝░░░░░░░╚══════╝╚═╝░░╚═╝╚═╝░░░╚═╝░░░╚═╝╚═╝░░╚══╝░╚═════╝░╚═╝╚═╝╚═╝
                            """ + reset);
                    System.exit(0);
                }
                default -> {
                    System.out.println("Invalid Choice. Please input either 1 or 0.");
                }
            }
        }
    }

    public static void progressBar() {
        try {
            String[] String = new String[0];
            ProgressBar.main(String);
        } catch (InterruptedException e) {
            e.printStackTrace();
        }
    }

    public static int userInputs(Scanner scanner) {
        int val = scanner.nextInt();
        scanner.nextLine();
        return val;
        // TODO - may be problem with newline?
    }

    public static int userCharInputs() {
        Scanner scanner = new Scanner(System.in);
        return scanner.next().charAt(0);
    }
}